/*********************************************************************************************************************
 * @file       		led.c
 * @version    		V1.0
 * @Software 			IAR 8.3 or MDK 5.24
 * @TargetCore		MK66FX
 * @date       		2019-12-13
 * @note					LED接口：
 *								Peripheral			MCU
 *								LED1						A14
 *								LED2						A15
 *								LED3						A16
 *								LED4						A17
 ********************************************************************************************************************/
 
#include "led.h"
#include "MK60_gpio.h"

/************************************************************************
 *	@brief	LED初始化
 *	@param	无
 *	@return	无
 *	@note		无
 ***********************************************************************/
void LED_Init(void)
{
	gpio_init(LED1,GPO,1);  //初始化LED2为高电平
	gpio_init(LED2,GPO,1);  //初始化LED3为高电平
	gpio_init(LED3,GPO,1);  //初始化LED4为高电平
	gpio_init(LED4,GPO,1);  //初始化LED5为高电平
}

/************************************************************************
 *	@brief	LED闪烁
 *	@param	无
 *	@return	无
 *	@note		无
 ***********************************************************************/
void LED_Flash(void)
{
//	LED_Port -> PTOR = (uint32)0x3C000;
	LED_Port -> PTOR = (1<<14);
}

/*--------------------END--------------------*/




























