/*********************************************************************************************************************
 * @file       	usart.c
 * @version			V1.0
 * @Software 		MDK 5.28
 * @TargetCore	MK66FX
 * @date       	2019-12-24
 * @note				USART1:
 *							USART2:
 *							USART3:			Camera
 *							USART4:			NRF
 *							USART5:			MPU
 ********************************************************************************************************************/

#include "usart.h"
#include "MK60_uart.h"

///////////////////////////////////////////////////////////////////////////////////////////////////

/*-------NRF-------*/
//TX:			PC14(USART4 RX)
//RX:			PC15(USART4 TX)
//RTS:		PC18
//CMD:		PC19
/*-----------------*/

/************************************************************************
 *	@brief	NRF初始化
 *	@param	baud: 波特率
 *	@return	无
 *	@note		无
 ***********************************************************************/
void NRF_Init(uint32_t baud)
{
	/* DEBUG_PORT 定义在MK60_uart.h中
	 * uart1为CH340
	 * uart4为无线
	 */
	uart_init(uart4,115200);						//初始化串口4
	uart_init(uart1,baud);							//初始化串口1
	gpio_init(NRF_RTS,GPI,0);						//初始化流控引脚
	port_init_NoAlt (NRF_RTS, PULLUP);	//上拉输入
	gpio_init(NRF_CMD,GPO,1);						//初始化命令引脚
	uart_rx_irq_en(uart4);       				//打开串口4接收中断
	EnableInterrupts;										//使能总中断
}
///////////////////////////////////////////////////////////////////////////////////////////////////
/*--------------------END--------------------*/















