/*********************************************************************************************************************
 * @file       	MyTask.h
 * @version			V1.0
 * @Software 		MDK 5.28
 * @TargetCore	MK66FX
 * @date       	2019-12-22
 * @note				所有的任务都写在 MyTask.c 中
 ********************************************************************************************************************/

#ifndef __MYTASK_H
#define __MYTASK_H

#include "FreeRTOS.h"
#include "task.h"

void Task_List_Init(void);

#endif

/*--------------------END--------------------*/





























